app/Controllers/BaseController.php

    public function initController(RequestInterface $request, ResponseInterface $response, LoggerInterface $logger)
    {
        // Do Not Edit This Line
        parent::initController($request, $response, $logger);

        // Preload any models, libraries, etc, here.

        // E.g.: $this->session = service('session');
        $this->session      = service('session');

        $this->CountryModel     = new CountryModel;
        $this->UserModel        = new UserModel;
        $this->ParkingLotModel  = new ParkingLotModel;
        $this->CustomerModel    = new CustomerModel;
        $this->VehicleModel     = new VehicleModel;
        $this->CustomerVehicleModel     = new CustomerVehicleModel;
        $this->WorkOrderModel   = new WorkOrderModel;
        $this->SettingsModel    = new SystemSettingsModel;
        $this->ParkingLogModel  = new ParkingLogModel;

        if($this->session->has('loggedIn'))
        {
            $this->data['logged_in_user']   = $this->UserModel->find($this->session->loggedIn);
---
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
AND `users`.`id` = '2'