app/Controllers/Vehicles.php

    public function vehicle_search($vin)
    {
        $vehicle = $this->VehicleModel->where('vin',strtoupper($vin))->first();
---
SELECT *
FROM `vehicles`
WHERE `vin` = 'VF32AKFWF41655120'
AND `vehicles`.`deleted_at` IS NULL
 LIMIT 1