app/Controllers/WorkOrders.php

SELECT *
FROM `customers`
WHERE `customers`.`deleted_at` IS NULL
AND `customers`.`id` = 6
---
    public function create_order()
    {
        $order_data['order_type']       = $this->request->getPost('order_type');
        $order_data['user_id']          = $this->request->getPost('user_id');
        $order_data['parking_lot_id']   = $this->request->getPost('parking_lot_id');

        if($order_data['order_type'] == 'park'){
            $IdentityService    = new \App\Services\IdentityService();
            $new_customer       = false;
            $new_vehicle        = false;

            $customer_id    = intval($this->request->getPost('customer_id'));

            $customer_data['first_name']           = $this->request->getPost('first_name');
            $customer_data['last_name']            = $this->request->getPost('last_name');
            $customer_data['phone_number']         = $this->request->getPost('phone_number');
            $customer_data['email_address']        = $this->request->getPost('email_address');

            if($customer_id == 0){
                $customer       = new \App\Entities\Customer();
                $customer_data['nationality']          = $this->request->getPost('nationality');
                $customer_data['identity_number_type'] = $this->request->getPost('identity_type');
                $customer_data['identity_number_hash'] = $this->request->getPost('identity_number_hash');
                $customer_data['identity_number_hash']   = $IdentityService->encryptIdentity( strtoupper($customer_data['identity_number_hash']) );

                $customer->fill($customer_data);
                $customer_id = $this->CustomerModel->insert($customer);
            }else{
                $customer       = $this->CustomerModel->find($customer_id);

SELECT *
FROM `vehicles`
WHERE `vehicles`.`deleted_at` IS NULL
AND `vehicles`.`id` = 5
---
                $vehicle->fill($vehicle_data);
                $vehicle_id = $this->VehicleModel->insert($vehicle);
            }else{
                $vehicle = $this->VehicleModel->find($vehicle_id);

SELECT *
FROM `customer_vehicles`
WHERE `customer_id` = 6
AND `vehicle_id` = 5
AND `customer_vehicles`.`deleted_at` IS NULL
 LIMIT 1
---
                    $this->VehicleModel->save($vehicle);
                }
            }
            $customer_vehicle = $this->CustomerVehicleModel->where(['customer_id' => $customer_id, 'vehicle_id' => $vehicle_id])->first();

INSERT INTO `customer_vehicles` (`customer_id`, `vehicle_id`, `created_at`, `updated_at`) VALUES (6, 5, '2025-10-24 19:35:07', '2025-10-24 19:35:07')
---
                $data = ['customer_id' => $customer_id, 'vehicle_id' => $vehicle_id];
                $customer_vehicle    = new \App\Entities\CustomerVehicle();
                $customer_vehicle->fill($data);
                $customer_vehicle_id = $this->CustomerVehicleModel->insert($customer_vehicle);

INSERT INTO `work_orders` (`order_type`, `user_id`, `parking_lot_id`, `customer_vehicle_id`, `created_at`, `updated_at`) VALUES ('park', '8', '1', 145, '2025-10-24 19:35:07', '2025-10-24 19:35:07')
---
        }
        $order  = new \App\Entities\WorkOrder();
        $order->fill($order_data);
        $work_order_id = $this->WorkOrderModel->insert($order);