app/Models/CustomerModel.php

SELECT `customers`.`id`, `customers`.`identity_number_hash`, `customers`.`identity_number_type`, `customers`.`nationality`, `customers`.`first_name`, `customers`.`last_name`, `customers`.`phone_number`, `customers`.`email_address`, `countries`.`name` as `country`
FROM `customers`
JOIN `countries` ON `countries`.`code_2` = `customers`.`nationality`
WHERE `customers`.`deleted_at` IS NULL
---
    public function getCustomerList()
    {
        return $this->select("{$this->table}.id, {$this->table}.identity_number_hash, {$this->table}.identity_number_type, {$this->table}.nationality, {$this->table}.first_name, {$this->table}.last_name, {$this->table}.phone_number, {$this->table}.email_address, {$this->tables['countries']}.name as country")
            ->join($this->tables['countries'], "{$this->tables['countries']}.code_2 = {$this->table}.nationality")
            ->findAll();