app/Models/SystemSettingsModel.php

SELECT *
FROM `system_settings`
WHERE `system_settings`.`deleted_at` IS NULL
---
    public function __construct()
    {
        parent::__construct();
        $this->table    = $this->tables['system_settings'];
        $this->data     = $this->findAll();